# Host: localhost  (Version: 5.5.40)
# Date: 2017-12-05 19:24:26
# Generator: MySQL-Front 5.3  (Build 4.120)

/*!40101 SET NAMES utf8 */;

#
# Structure for table "user"
#

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `user` text NOT NULL COMMENT '用户名',
  `pw` text NOT NULL COMMENT '密码',
  PRIMARY KEY (`user`(255))
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

#
# Data for table "user"
#

/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('admin','admin');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;

#
# Structure for table "图书管理表"
#

DROP TABLE IF EXISTS `图书管理表`;
CREATE TABLE `图书管理表` (
  `编号` int(11) NOT NULL AUTO_INCREMENT,
  `书名` varchar(255) NOT NULL,
  `出版社` varchar(255) DEFAULT NULL,
  `类别` varchar(255) DEFAULT NULL,
  `作者` varchar(255) DEFAULT NULL,
  `数量` int(11) NOT NULL,
  `定价` decimal(7,2) NOT NULL,
  `封面` mediumblob,
  `日期` date DEFAULT NULL,
  `备注` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM AUTO_INCREMENT=57 DEFAULT CHARSET=utf8;

#
# Data for table "图书管理表"
#

/*!40000 ALTER TABLE `图书管理表` DISABLE KEYS */;
INSERT INTO `图书管理表` VALUES (1,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(2,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(3,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(4,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(5,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(6,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(7,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(8,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(9,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(10,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(11,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(12,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(13,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(14,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(15,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(16,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(17,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(18,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(19,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(20,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(21,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(22,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(23,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(24,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(25,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(26,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(27,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(28,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(29,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(30,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(31,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(32,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(33,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(34,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(35,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(36,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(37,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(38,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(39,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(40,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(41,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(42,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(43,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(44,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(45,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(46,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(47,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(48,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(49,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(50,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(51,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(52,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(53,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(54,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL),(55,'0基础学java','清华大学出版社','计算机','徐海涛',60,60.99,NULL,'2017-01-11','java类图书补充'),(56,'0基础学jsp','机械工业出版社','计算机','徐海涛',160,99.20,NULL,'2017-10-10',NULL);
/*!40000 ALTER TABLE `图书管理表` ENABLE KEYS */;
